emacs.org
#
# file: emacs.org
#
# author:     André Beyer <beyeran@gmail.com>
# Time-stamp: <2012-07-30 11:06:45 beyeran>
#

* Essentials
** Macros
#+begin_src emacs-lisp :tangle emacs.el
;;
;; file: emacs.el
;;


;; some macros
(defmacro sys-diversification (gnu/linux &optional darwin win)
  "System diversification for Linux, Mac and Windows, focus on Linux"
  `(cond ((sys-type 'darwin) ,darwin)
         ((sys-type 'gnu/linux) ,gnu/linux)
         ((sys-type 'windows-nt) ,win)
         (t nil)))

(defun sys-type (name)
  (if (eq system-type name)
      t
    nil))

(defmacro require-beyeran (name)
  (let ((require-symbol (intern (concat "beyeran-" name))))
    `(require ',require-symbol)))

;; strangely this function isn't available on my linux system
(sys-diversification
 (defun flatten (list)
   (cond ((null list) nil)
         ((atom list) list)
         (t
          (let ((old list)
                (new ())
                item)
            (while old
              (if (atom old)
                  (setq item old
                        old nil)
                (setq item (car old)
                      old (cdr old)))
              ;; Make item atomic
              (while (consp item)
                (if (cdr item)
                    (setq old (cons (cdr item) old)))
                (setq item (car item)))
              (setq new (cons item new)))
            (reverse new))))))

#+end_src
** Init File
#+begin_src emacs-lisp :tangle emacs.el

;; possible differences between paths
(setq explicit-shell-file-name "/bin/zsh")
(setq shell-file-name "zsh")
(setenv "SHELL" shell-file-name)
(add-hook 'comint-output-filter-functions 'comint-strip-ctrl-m)

;; functions for loading the right folder
(setq dotfiles-dir (file-name-directory
  (or (buffer-file-name) load-file-name)))

(setq beyeran-dir (concat dotfiles-dir "beyeran/"))

(setq extensions-dir (concat dotfiles-dir "extensions/"))

(add-to-list 'load-path dotfiles-dir)
(add-to-list 'load-path beyeran-dir)
(add-to-list 'load-path extensions-dir)

(defun add-to-loadpath (name)
  (add-to-list 'load-path (concat extensions-dir name)))

(defun load-multiple (folder-list)
  (mapcar #'(lambda (n)
              (add-to-loadpath n)) folder-list))
#+end_src
** Loading Paths
#+begin_src emacs-lisp :tangle emacs.el

(setq *extension-list* '("color-theme" 
                         "paredit"
                         "org-mode"
                         "org-mode/lisp"
                         "ido"
                         "ruby-mode"
                         "haskell-mode"
                         "haskell-indent"
                         "clojure-mode"
                         "swank-clojure"
                         "prolog"
                         "scheme"
                         "scss-mode"
                         "smex"
                         "ess"
                         "ess/lisp"
                         "coffee-mode"
                         "shen-mode"
                         "maxima"))

(sys-diversification
 (append *extension-list* '("/usr/share/emacs/site-lisp/slime/")))

(load-multiple *extension-list*)
#+end_src
** Requirements
#+begin_src emacs-lisp :tangle emacs.el

;; requiring local files

(require-beyeran "misc")
(require-beyeran "auto-insert")
(require-beyeran "paredit")
(require-beyeran "smex")
(require-beyeran "org")
(require-beyeran "org-babel")
(require-beyeran "org-reftex")
(require-beyeran "org-export-templates")
(require-beyeran "jekyll")
(require-beyeran "ruby-mode")
(require-beyeran "haskell-mode")
(require-beyeran "clojure-mode")
(require-beyeran "prolog-mode")
(require-beyeran "shen-mode")
;;(require-beyeran "scheme-mode")
(require-beyeran "scss-mode")
(require-beyeran "coffee-mode")
(require-beyeran "ess")
(require-beyeran "gtd")
(require-beyeran "maxima")
;;(require-beyeran "erlang-mode")
(sys-diversification
 () 
 (require-beyeran "slime"))

#+end_src
* General Stuff
  In here there is some general stuff which means: some settings
  (tool-bar, curser etc).
** HUD & general Information
#+begin_src emacs-lisp :tangle beyeran/beyeran-misc.el
;;
;; file: beyeran-misc.el
;;

;;;;;;;; general stuff ;;;;;;;
(require 'cl)

(tool-bar-mode 0)
(menu-bar-mode 0)
(scroll-bar-mode 0)
(show-paren-mode 1)
(setq inhibit-spalsh-screen nil)

(sys-diversification 
 (custom-set-faces
  '(default ((t (:inherit nil :stipple nil :background "#000000" :foreground "#a6a6a6" :inverse-video nil 
                          :box nil :strike-through nil :overline nil :underline nil :slant normal :weight normal 
                          :height 90 :width normal :foundry "xos4" :family "dina"))))))

(setq inihibit-startup-echo-area-message "André")
(setq inhibit-startup-screen t)
(setq initial-scratch-message nil)


#+end_src
** Color Theme
#+begin_src emacs-lisp :tangle beyeran/beyeran-color-theme-linux.el
;;
;; file: beyeran-color-theme-linux.el
;;

;;;; color-theme ;;;;
(defun beyeran-color-theme-linux ()
  (interactive)
  (color-theme-install
   '(beyeran-color-theme-linux
      ((background-color . "#000000")
      (background-mode . light)
      (border-color . "#030303")
      (cursor-color . "#4f4f4f")
      (foreground-color . "#a6a6a6")
      (mouse-color . "black"))
     (fringe ((t (:background "#030303"))))
     (mode-line ((t (:foreground "#ffffff" :background "#242424"))))
     (region ((t (:background "#121212"))))
     (font-lock-builtin-face ((t (:foreground "#878787"))))
     (font-lock-comment-face ((t (:foreground "#434242"))))
     (font-lock-function-name-face ((t (:foreground "#d12700"))))
     (font-lock-keyword-face ((t (:foreground "#f75c08"))))
     (font-lock-string-face ((t (:foreground "#ffffff"))))
     (font-lock-type-face ((t (:foreground"#fd8c35"))))
     (font-lock-variable-name-face ((t (:foreground "#fc2222"))))
     (minibuffer-prompt ((t (:foreground "#f53f00" :bold t))))
     (font-lock-warning-face ((t (:foreground "Red" :bold t))))
     )))

(provide 'beyeran-color-theme-linux)
#+end_src

#+begin_src emacs-lisp :tangle beyeran/beyeran-color-theme-mac.el
;;
;; file: beyeran-color-theme-mac.el
;;

(defun beyeran-color-theme-mac ()
  (interactive)
  (color-theme-install
   '(beyeran-color-theme-mac
      ((background-color . "#1f1f1f")
      (background-mode . light)
      (border-color . "#2b2b2b")
      (cursor-color . "#333333")
      (foreground-color . "#b5b5b5")
      (mouse-color . "black"))
     (fringe ((t (:background "#2b2b2b"))))
     (mode-line ((t (:foreground "#000000" :background "#666666"))))
     (region ((t (:background "#999999"))))
     (font-lock-builtin-face ((t (:foreground "#aa37e6"))))
     (font-lock-comment-face ((t (:foreground "#3b3b3b"))))
     (font-lock-function-name-face ((t (:foreground "#6b6b6b"))))
     (font-lock-keyword-face ((t (:foreground "#ff362e"))))
     (font-lock-string-face ((t (:foreground "#1b79fe"))))
     (font-lock-type-face ((t (:foreground"#3fb819"))))
     (font-lock-variable-name-face ((t (:foreground "#999999"))))
     (minibuffer-prompt ((t (:foreground "#7299ff" :bold t))))
     (font-lock-warning-face ((t (:foreground "Red" :bold t))))
     )))

(provide 'beyeran-color-theme-mac)
#+end_src

#+begin_src emacs-lisp :tangle beyeran/sweyla779450.el
;;
;; file: green-hell-mac.el
;;

(defun sweyla779450 ()
  "Theme generated by Sweyla: http://themes.sweyla.com/seed/779450/"
  (interactive)
  (color-theme-install
   '(sweyla779450
     ((background-color . "#000000")
      (foreground-color . "#FFFFFF")
      (background-mode . dark)
      (border-color . "#323232")
      (cursor-color . "#FFFFFF")
      (mouse-color . "#323232"))
     (mode-line ((t (:foreground "#FFFFFF" :background "#323232"))))
     (region ((t (:background "#323232"))))

     (font-lock-comment-face ((t (:foreground "#A4FFAA"))))
     (font-lock-constant-face ((t (:foreground "#FFCC84"))))
     (font-lock-builtin-face ((t (:foreground "#FFA8A1"))))
     (font-lock-function-name-face ((t (:foreground "#FFFF5F"))))
     (font-lock-variable-name-face ((t (:foreground "#FFFFD5"))))
     (font-lock-keyword-face ((t (:foreground "#B1E56E"))))
     (font-lock-string-face ((t (:foreground "#B8D88C"))))
     (font-lock-doc-string-face ((t (:foreground "#B8D88C"))))
     (font-lock-type-face ((t (:foreground "#DFFF87"))))
     )))

(provide 'sweyla779450)
#+end_src

#+begin_src emacs-lisp :tangle beyeran/color-hellraiser.el
;;; color-theme ;;;;
(defun color-hellraiser ()
  (interactive)
  (color-theme-install
   '(color-hellraiser
      ((background-color . "#090909")
      (background-mode . dark)
      (border-color . "#121212")
      (cursor-color . "#b0b0b0")
      (foreground-color . "#dedede")
      (mouse-color . "black"))
     (fringe ((t (:background "#121212"))))
     (mode-line ((t (:foreground "#393939" :background "#121212"))))
     (mode-line-inactive ((t (:foreground "#393939" :background "#101010"))))
     (region ((t (:background "#020202"))))
     (font-lock-builtin-face ((t (:foreground "#da4939"))))
     (font-lock-comment-face ((t (:foreground "#404040"))))
     (font-lock-function-name-face ((t (:foreground "#ff6c29a"))))
     (font-lock-keyword-face ((t (:foreground "#da4939"))))
     (font-lock-string-face ((t (:foreground "#509f7e"))))
     (font-lock-type-face ((t (:foreground "#6d9cbe"))))
     (font-lock-variable-name-face ((t (:foreground "#5e468c"))))
     (minibuffer-prompt ((t (:foreground "#435d75" :bold t))))
     (font-lock-warning-face ((t (:foreground "#435d75" :bold t)))))))

(provide 'color-hellraiser)
#+end_src

#+begin_src emacs-lisp :tangle beyeran/beyeran-misc.el
(require 'color-theme)

(require 'color-hellraiser)
(color-theme-initialize)
(color-hellraiser)


(setq color-theme-is-global t)
#+end_src
** Cursor
#+begin_src emacs-lisp :tangle beyeran/beyeran-misc.el
;;;; cursor ;;;;
(setq-default cursor-type 'box)
(setq messages-buffer-max-lines 400)
(setq blink-cursor-delay 0.2)
(setq blink-cursor-interval 0.3)
#+end_src
** General Variables
#+begin_src emacs-lisp :tangle beyeran/beyeran-misc.el
;;;;;;;; general variables ;;;;;;

(define-key global-map (kbd "C-c f") 'find-function)
(setq-default tab-width 4)
#+end_src
** Comments and Timestamps
#+begin_src emacs-lisp :tangle beyeran/beyeran-misc.el
;;;; comments ;;;;
(setf comment-style 'indent)

(add-hook 'emacs-lisp-mode-hook #'imenu-add-menubar-index)
(global-set-key [mouse-3] 'mouse-popup-menubar-stuff)

;;;; time ;;;;
(display-time)
(setf display-time-day-and-date nil)
(setf display-time-24hr-format t)

;;;; timestamp ;;;;
(defvar iso-date-format "%Y-%m-%dT%H:%M:%S:z"
  "Format string for ISO dates.")

(defun iso-timestamp (&optional time)
  (format-time-sting iso-date-format
		     (or time (current-time))))

(defun insert-iso-timestamp ()
  (interactive)
  (insert (iso-timestamp)))

(defun iso-timestamp-sexp (&optional time)
  (parse-time-string (iso-timestamp)))

(require 'time-stamp)
(add-hook 'before-save-hook 'time-stamp)
(setf time-stamp-active t)
#+end_src

** Misc Functions
*** Lorem
   Webdesign is a kind of a hobby for me so I often encounter
   situations where I need to use text columns for veryfing my layout
   settings. The commonly used "lorem ipsum" seems like a standart
   text to do that, here's a function which generates it:

#+begin_src emacs-lisp :tangle beyeran/beyeran-misc.el
(defun lorem ()
  "Insert a lorem ipsum."
  (interactive)
  (insert "Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do "
          "eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim"
          "ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut "
          "aliquip ex ea commodo consequat. Duis aute irure dolor in "
          "reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla "
          "pariatur. Excepteur sint occaecat cupidatat non proident, sunt in "
          "culpa qui officia deserunt mollit anim id est laborum."))
#+end_src
*** html umlaute
#+begin_src emacs-lisp :tangle beyeran/beyeran-misc.el
;;;; Custom Functions ;;;;
(defun html-umlaute ()
  "replaces iso-umlaute with html-umlaute"
  (interactive)
  (let ((case-fold-search nil))
    (save-excursion
      (goto-char (point-min))
      (while (re-search-forward
              (mapconcat '(lambda (x) (car x)) *html-entities* "\\|")
              nil t)
        (replace-match (cdr (assoc (match-string 0) *html-entities*)))))))

;;;; Variables ;;;;
(setf *html-entities*
  '(("Ä" . "&Auml;")
    ("ä" . "&auml;")
    ("Ö" . "&Ouml;")
    ("ö" . "&ouml;")
    ("Ü" . "&Uuml;")
    ("ü" . "&Uuml;")
    ("ß" . "&szling;")))
#+end_src
*** massive-shrink
#+begin_src emacs-lisp :tangle beyeran/beyeran-misc.el
(defmacro defshrink (system space)
  `(defun ,system ()
     (interactive)
     (shrink-window ,space)))

(defshrink massive-shrink-darwin 20)
(defshrink massive-shrink-linux 14)
(defshrink massive-shrink-win 25)

(global-set-key (kbd "C-x C-q")
                (sys-diversification
                 'massive-shrink-linux
                 'massive-shrink-darwin))

#+end_src
